Dr-Vah/Project-of-Electronic-Circuits/BLEControl/ESP32/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 蓝牙 BLE（Bluedroid GATT 服务）
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
# ESP32-S3 默认走 BLE 5.0，需显式开启 BLE 4.2 特性才能用传统广播 API
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_BT_BLE_42_ADV_EN=y

# 控制台走 UART（GPIO43/44），与之前项目一致
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
